#高级索引
import numpy as np

#数组索引

x1=np.arange(1,7)
x=x1.reshape(3,2)
print(x)
y=x[[0,1,2],[0,1,0]]#列表数组索引获取数组中(0,0)，(1,1)和(2,0)位置处的元素。
print(y)
z=x[(0,1,2),(0,1,0)]#元组索引获取数组中(0,0)，(1,1)和(2,0)位置处的元素。
print(z)

print('--------------------------------------------------------------------')
a1=np.arange(12)
a=a1.reshape(4,3)
print(a)
rows=np.array([[0,0],[3,3]])
cols=np.array([[0,2],[0,2]])
b=a[rows,cols]#以整数数组进行索引输出的也是数组形式的（好好理解）
print('这个数组的四个角元素是')
print(b)
'''
-------------------------------可以推出取角元素的通式--------------------------------------
rows=np.array([[0,0],[行-1，行-1]])
cols=np.array([[0,列-1],[0，列-1]])
print(x[rows,cols])
-------------------------------可以推出取任意行列交叉元素的通式--------------------------------------
rows=np.array([[行1，行1，...,行1（个数为列个）]，...[行n，行n，...,行n（个数为列个）](个数为行个)])
cols=np.array([[列1，列2，...,列n（个数为列个）]，...[列1，列2，...,列n（个数为列个）](个数为行个)])
print(x[rows,cols])
'''
#如果要取2，3，4行以及1，3列的交叉元素

rows=np.array([[1,1],[2,2],[3,3]])
cols=np.array([[0,2],[0,2],[0,2]])
c=a[rows,cols]
print(c)

