import numpy as np

a=np.random.rand(3,2,3)#生成均匀分布在（0，1）的随机数组
print(a)
print('-----------------------------------------------------')
b=np.random.randn(4,4)#创建标准正态分布的随机数组，平均数为0，标准差为1
print(b)
print('-----------------------------------------------------')
c=np.random.randint(0,10,(3,3))#给定上下限范围生成随机整数，形状是shape
print(c)
print('------------------------------------------------------')
d=np.random.uniform(0,10,(2,2))#给定上下限范围产生具有均匀分布的数组，形状是size
print(d)
print('-------------------------------------------------------')
e=np.random.normal(0,1,(5,5))#产生一个5×5的正态分布数组，均值为0方差为1
print(e)
print('-------------------------------------------------------')
np.random.seed(0)#使用相同的随机种子之后，每次生成相同的随机数。
f=np.random.randint(0,10,(3,3))
print(f)
